Q1 You have a DataFrame with employee names, their departments, and their salaries:
Group the DataFrame by Department and calculate the average salary for each department.

In [2]:
import pandas as pd

data = {
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],
    'Department': ['HR', 'IT', 'HR', 'IT', 'IT', 'HR'],
    'Salary': [50000, 60000, 55000, 70000, 65000, 58000]
}
df = pd.DataFrame(data)
df

  Employee Department  Salary
0    Alice         HR   50000
1      Bob         IT   60000
2  Charlie         HR   55000
3    David         IT   70000
4      Eve         IT   65000
5    Frank         HR   58000

In [3]:
avg_sal = df.groupby('Department')['Salary'].mean() #agg
avg_sal

Department
HR    54333.333333
IT    65000.000000
Name: Salary, dtype: float64

               sum          mean    max
Department
HR          163000  54333.333333  58000
IT          195000  65000.000000  70000

Q2 Using the same DataFrame as above, perform multiple aggregations on the salary (e.g., sum, mean, and max) for each department.

Group by Department and apply the following aggregations:
Sum of salary
Mean of salary
Max salary

In [5]:
agg_sal = df.groupby('Department')['Salary'].agg(['sum', 'mean', 'max'])
agg_sal

               sum          mean    max
Department
HR          163000  54333.333333  58000
IT          195000  65000.000000  70000

Q3 Given a DataFrame with employee data that includes names, departments, and ages:
Group the DataFrame by Department, and filter out groups where the average age is less than 40.

In [6]:
# Group by Department and filter out groups where the average age is less than 40
data1 = {
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Monk', 'Sonk', 'Donk'],
    'Department': ['HR', 'IT', 'HR', 'IT', 'IT', 'HR', 'MECH', 'CHEM', 'BIO'],
    'Age': [60, 50, 35, 40, 45, 50, 33, 34, 22]
}
df1 = pd.DataFrame(data1)
df1

  Employee Department  Age
0    Alice         HR   60
1      Bob         IT   50
2  Charlie         HR   35
3    David         IT   40
4      Eve         IT   45
5    Frank         HR   50
6     Monk       MECH   33
7     Sonk       CHEM   34
8     Donk        BIO   22

In [12]:
avg_age = df1.groupby('Department')['Age'].mean()


fil_age = avg_age[avg_age <= 40]
print(fil_age)

Department
BIO     22.0
CHEM    34.0
MECH    33.0
Name: Age, dtype: float64

Q4 Using the same salary DataFrame as in exercise 1:

Q5 Grouping by Multiple Columns

In [16]:
data2 = {
    'Store': ['A', 'B', 'A', 'B', 'A', 'B'],
    'Month': ['Jan', 'Jan', 'Feb', 'Feb', 'Mar', 'Mar'],
    'Sales': [100, 150, 200, 250, 300, 350]
}
df2 = pd.DataFrame(data2)

Group the data by both Store and Month, then calculate the total sales for each group.

In [17]:
store_sum = df2.groupby(['Store', 'Month'])['Sales'].sum()
store_sum

Store  Month
A      Feb      200
       Jan      100
       Mar      300
B      Feb      250
       Jan      150
       Mar      350
Name: Sales, dtype: int64